import json

import pytest

@pytest.fixture
def data_for_services():
    return [
        {
            "Номер карты": "*7197",
            "Дата платежа": "01.01.2021",
            "Дата операции": "01.01.2021 10:00:00",
            "Категория": "Супермаркеты",
            "Описание": "Колхоз",
            "Сумма операции с округлением": 1011,
            "Кэшбэк": 10
        },
        {
            "Номер карты": "*7197",
            "Дата платежа": "02.01.2021",
            "Дата операции": "02.01.2021 10:00:00",
            "Категория": "Каршеринг",
            "Описание": "Ситидрайв",
            "Сумма операции с округлением": 505,
            "Кэшбэк": 5
        },
        {
            "Номер карты": "*5091",
            "Дата платежа": "03.03.2021",
            "Дата операции": "03.03.2021 10:00:00",
            "Категория": "Дом и ремонт",
            "Описание": "МаксидоМ",
            "Сумма операции с округлением": 1345,
            "Кэшбэк": 13
        },
        {
            "Номер карты": "*7197",
            "Дата платежа": "08.03.2021",
            "Дата операции": "09.03.2021 10:00:00",
            "Категория": "Супермаркеты",
            "Описание": "Лента",
            "Сумма операции с округлением": 2080,
            "Кэшбэк": 20
        },
        {
            "Номер карты": "*4556",
            "Дата платежа": "02.05.2021",
            "Дата операции": "02.05.2021 10:00:00",
            "Категория": "Канцтовары",
            "Описание": "Mitrankov M.V.",
            "Сумма операции с округлением": 235,
            "Кэшбэк": 20
        },
        {
            "Номер карты": "*4556",
            "Дата платежа": "15.05.2021",
            "Дата операции": "16.05.2021 10:00:00",
            "Категория": "Дом и ремонт",
            "Описание": "Ofisnaya mebel",
            "Сумма операции с округлением": 5023,
            "Кэшбэк": 50
        },
    ]

@pytest.fixture
def categories_with_profitable_cashback():
    return json.dumps(
            {
                "Супермаркеты": 10,
                "Каршеринг": 5
            }, ensure_ascii=False, indent=4)