import pandas as pd
import pytest


@pytest.fixture
def data_for_reports() -> pd.DataFrame:
    return pd.DataFrame(
        {
            "Дата операции": [
                "31.12.2021 15:44:39",
                "29.12.2021 22:32:24",
                "28.12.2021 13:44:39",
                "29.11.2021 18:09:38",
                "26.10.2021 18:36:13",
                "09.09.2021 16:21:58",
            ],
            "Категория": [
                "Супермаркеты",
                "Супермаркеты",
                "Каршеринг",
                "ЖКХ",
                "Фастфуд",
                "Супермаркеты",
            ],
            "Сумма операции": [
                1000,
                650,
                300,
                5000,
                1100,
                300,
            ],
        }
    )
