import json

import pytest

@pytest.fixture
def data_for_services():
import pandas as pd
import pytest


@pytest.fixture
def data_for_views() -> list[dict]:
    return [
        {
            "Номер карты": "*7197",
            "Дата платежа": "01.01.2021",
            "Дата операции": "01.01.2021 10:00:00",
            "Категория": "Супермаркеты",
            "Описание": "Колхоз",
            "Сумма операции с округлением": 1011,
            "Кэшбэк": 10
            "Сумма операции с округлением": 1000,
        },
        {
            "Номер карты": "*7197",
            "Дата платежа": "02.01.2021",
            "Дата операции": "02.01.2021 10:00:00",
            "Категория": "Каршеринг",
            "Описание": "Ситидрайв",
            "Сумма операции с округлением": 505,
            "Кэшбэк": 5
            "Сумма операции с округлением": 500,
        },
        {
            "Номер карты": "*5091",
            "Дата платежа": "03.03.2021",
            "Дата операции": "03.03.2021 10:00:00",
            "Категория": "Дом и ремонт",
            "Описание": "МаксидоМ",
            "Сумма операции с округлением": 1345,
            "Кэшбэк": 13
            "Сумма операции с округлением": 1300,
        },
        {
            "Номер карты": "*7197",
            "Дата платежа": "08.03.2021",
            "Дата операции": "09.03.2021 10:00:00",
            "Категория": "Супермаркеты",
            "Описание": "Лента",
            "Сумма операции с округлением": 2080,
            "Кэшбэк": 20
            "Сумма операции с округлением": 2000,
        },
        {
            "Номер карты": "*4556",
            "Дата платежа": "02.05.2021",
            "Дата операции": "02.05.2021 10:00:00",
            "Категория": "Канцтовары",
            "Описание": "Mitrankov M.V.",
            "Сумма операции с округлением": 235,
            "Кэшбэк": 20
            "Сумма операции с округлением": 200,
        },
        {
            "Номер карты": "*4556",
            "Дата платежа": "15.05.2021",
            "Дата операции": "16.05.2021 10:00:00",
            "Категория": "Дом и ремонт",
            "Описание": "Ofisnaya mebel",
            "Сумма операции с округлением": 5023,
            "Кэшбэк": 50
        },
    ]

@pytest.fixture
def categories_with_profitable_cashback():
    return json.dumps(
            {
                "Супермаркеты": 10,
                "Каршеринг": 5
            }, ensure_ascii=False, indent=4)
            "Сумма операции с округлением": 5000,
        },
    ]


@pytest.fixture
def info_about_cards() -> dict:
    return {
        "cards": [
            {
                "last_digits": "7197",
                "total": 3500,
                "cashback": 35.0,
            },
            {
                "last_digits": "5091",
                "total": 1300,
                "cashback": 13.0,
            },
            {
                "last_digits": "4556",
                "total": 5200,
                "cashback": 52.0,
            },
        ]
    }


@pytest.fixture
def top_five_transactions() -> dict:
    return {
        "top_transactions": [
            {
                "date": "15.05.2021",
                "amount": 5000,
                "category": "Дом и ремонт",
                "description": "Ofisnaya mebel",
            },
            {
                "date": "08.03.2021",
                "amount": 2000,
                "category": "Супермаркеты",
                "description": "Лента",
            },
            {
                "date": "03.03.2021",
                "amount": 1300,
                "category": "Дом и ремонт",
                "description": "МаксидоМ",
            },
            {
                "date": "01.01.2021",
                "amount": 1000,
                "category": "Супермаркеты",
                "description": "Колхоз",
            },
            {
                "date": "02.01.2021",
                "amount": 500,
                "category": "Каршеринг",
                "description": "Ситидрайв",
            },
        ],
    }


@pytest.fixture
def filter_by_date():
    return [
        {
            "Номер карты": "*7197",
            "Дата платежа": "01.01.2021",
            "Дата операции": "01.01.2021 10:00:00",
            "Категория": "Супермаркеты",
            "Описание": "Колхоз",
            "Сумма операции с округлением": 1000,
        },
        {
            "Номер карты": "*7197",
            "Дата платежа": "02.01.2021",
            "Дата операции": "02.01.2021 10:00:00",
            "Категория": "Каршеринг",
            "Описание": "Ситидрайв",
            "Сумма операции с округлением": 500,
        },
    ]


@pytest.fixture
def currency_rates() -> dict:
    return {
        "currency_rates": [
            {"currency": "USD", "rate": 71.0},
            {"currency": "EUR", "rate": 71.0},
        ]
    }


@pytest.fixture
def finnhub_stock_prices() -> dict:
    return {
        "stock_prices": [
            {"stock": "AAPL", "price": 100},
            {"stock": "AMZN", "price": 100},
            {"stock": "GOOGL", "price": 100},
            {"stock": "MSFT", "price": 100},
            {"stock": "TSLA", "price": 100},
        ]
    }
def data_for_reports() -> pd.DataFrame:
    return pd.DataFrame(
        {
            "Дата операции": [
                "31.12.2021 15:44:39",
                "29.12.2021 22:32:24",
                "28.12.2021 13:44:39",
                "29.11.2021 18:09:38",
                "26.10.2021 18:36:13",
                "09.09.2021 16:21:58",
            ],
            "Категория": [
                "Супермаркеты",
                "Супермаркеты",
                "Каршеринг",
                "ЖКХ",
                "Фастфуд",
                "Супермаркеты",
            ],
            "Сумма операции": [
                1000,
                650,
                300,
                5000,
                1100,
                300,
            ],
        }
    )
